print("Здравствуйте! Как Вас зовут?")
name = input()
print("Очень приятно,", name + "! Меня зовут Марк.")
print("Сколько Вам лет?")
age = int(input())
mage = 78
if age < mage:
    print("Да,", name + ", я старше Вас на", mage - age, "лет.")
elif age > mage:
    print("Да,", name + ", Вы старше меня на", age - mage, "лет.")

print("Вам нравится программировать?")
answer = input()
if answer == "да":
    print("Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.")
elif answer == "нет":
    print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")
