print("Собака короткошёрстной породы?")
q1 = input()
if q1 == "да":
    print("Рост собаки менее 50 см?")
    q2 = input()
    if q2 == "да":
        print("У собаки короткий хвост?")
        q3 = input()
        if q3 == "да":
            print("английский бульдог")
        else:
            print("У собаки длинные уши?")
            q4 = input()
            if q4 == "да":
                print("гончая")
            else:
                print("У собаки короткое тело?")
                q5 = input()
                if q5 == "да":
                    print("мопс")
                else:
                    print("чихуахуа")
    else:
        print("Собака весит более 50 кг?")
        q3 = input()
        if q3 == "да":
            print("датский дог")
        else:
            print("фоксхаунд")
else:
    print("Рост собаки менее 50 см?")
    q2 = input()
    if q2 == "да":
        print("У собаки доброжелательный характер?")
        q3 = input()
        if q3 == "да":
            print("кокер-спаниэль")
        else:
            print("ирландский сеттер")
    else:
        print("У собаки рост менее 70 см?")
        q3 = input()
        if q3 == "да":
            print("У собаки длинные уши?")
            q4 = input()
            if q4 == "да":
                print("большой ванденский грифон")
            else:
                print("колли")
        else:
            print("Окрас рыжий с белыми отметинами?")
            q4 = input()
            if q4 == "да":
                print("сенбернар")
            else:
                print("Белоснежный окрас?")
                q5 = input()
                if q5 == "да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")
